<h1>Combining DataSets: Concat and Append</h1>

In [1]:
# Series and DataFrames are built with the type of operation in mind where two different datasets can be 
# concatenated and perform joins, merges or any kind of overlaps. 
# Pandas include functions and methods that make this sort of data wrangling fast and straightforward.

# Standard imports
import numpy as np
import pandas as pd

In [4]:
# A function to create a DataFrame of a particular form:
def make_df(cols, ind):
    """Quickly make a DataFrame"""
    data = {c:[str(c) + str(i) for i in ind] for c in cols}
    return pd.DataFrame(data, ind)

In [5]:
# Example usage of function created
make_df("ABC",range(3))

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2

<h3>Concatenation of Numpy Arrays</h3>

In [6]:
# Concatenation of Series and DataFrame objects is very similar to concatenation of Numpy arrays, which 
# can be done via the np.concatenate function. 
x = [1,2,3]
y = [4,5,6]
z = [7,8,9]
np.concatenate([x,y,z])

array([1, 2, 3, 4, 5, 6, 7, 8, 9])

In [7]:
# Additionally it takes an axis keyword that allows you to specify the axis along which the result will be 
# concatenated. 
x =[[1,2],
    [3,4]]
np.concatenate([x,x], axis=1)

array([[1, 2, 1, 2],
       [3, 4, 3, 4]])

<h3>Simple Concatenation with pd.concat</h3>

In [8]:
# Pandas has a function pd.concat(), with syntax similar to pd.concatenate() but with varios options
pd.concat??

In [9]:
# pd.concat() can be used for a simple concatenation of Series or DataFrame objects, just as np.conatenate()
# can be used for simple concatenation of arrays:
ser1 = pd.Series(["A","B","C"], index=[1,2,3])
ser2 = pd.Series(["D","E","F"], index=[4,5,6])
pd.concat([ser1,ser2])

1    A
2    B
3    C
4    D
5    E
6    F
dtype: object

In [10]:
# It also works to concatenate higher dimensional objects such as DataFrames
df1 = make_df("AB",[1,2])
df2 = make_df("AB",[3,4])
print(df1); print(df2);print(pd.concat([df1,df2]))

    A   B
1  A1  B1
2  A2  B2
    A   B
3  A3  B3
4  A4  B4
    A   B
1  A1  B1
2  A2  B2
3  A3  B3
4  A4  B4

In [11]:
# By Default, the concatenation takes place row-wise within the Dataframe that is axis=0. Axis can be specified 
# in pd.concat
df3 = make_df("AB",[0,1])
df4 = make_df("Cd",[0,1])
print(df3);print(df4);print(pd.concat([df3,df4],axis="col"))

    A   B
0  A0  B0
1  A1  B1
    C   d
0  C0  d0
1  C1  d1

ValueError: No axis named col for object type DataFrame

In [12]:
df3 = make_df("AB",[0,1])
df4 = make_df("Cd",[0,1])
print(df3);print(df4);print(pd.concat([df3,df4],axis=0))

    A   B
0  A0  B0
1  A1  B1
    C   d
0  C0  d0
1  C1  d1
     A    B    C    d
0   A0   B0  NaN  NaN
1   A1   B1  NaN  NaN
0  NaN  NaN   C0   d0
1  NaN  NaN   C1   d1

In [13]:
df3 = make_df("AB",[0,1])
df4 = make_df("Cd",[0,1])
print(df3);print(df4);print(pd.concat([df3,df4],axis=1))

    A   B
0  A0  B0
1  A1  B1
    C   d
0  C0  d0
1  C1  d1
    A   B   C   d
0  A0  B0  C0  d0
1  A1  B1  C1  d1

In [14]:
pd.concat?

In [15]:
# use columns to define axis
df3 = make_df("AB",[0,1])
df4 = make_df("Cd",[0,1])
print(df3);print(df4);print(pd.concat([df3,df4],axis="columns"))

    A   B
0  A0  B0
1  A1  B1
    C   d
0  C0  d0
1  C1  d1
    A   B   C   d
0  A0  B0  C0  d0
1  A1  B1  C1  d1

<h4>Duplicate Indices</h4>

In [16]:
# Pandas concatenation preserves indices, even if the result will have duplicate indices. 

x = make_df("AB",[0,1])
y = make_df("AB",[2,3])
y.index = x.index
print(x);print(y);print(pd.concat([x,y]))

    A   B
0  A0  B0
1  A1  B1
    A   B
0  A2  B2
1  A3  B3
    A   B
0  A0  B0
1  A1  B1
0  A2  B2
1  A3  B3

<h4>Catching the repeats as an error</h4>

In [17]:
# If you would like to verify that the indices in the result of pd.concat() do not overlap specify verify_integrity
# flag.With this flag set to True, duplicate indices will raise an expxception. 
try:
    pd.concat([x,y],verify_integrity=True)
except ValueError as exception:
    print("ValueErrors is ", exception)

ValueErrors is  Indexes have overlapping values: Int64Index([0, 1], dtype='int64')

<h4>Ignoring the index</h4>

In [18]:
# To ignore an index use the flag ignore_index flag. 

# With this set to True, the concatenation will create a new integer index for the resulting Series. 

print(x);print(y);print(pd.concat([x,y], ignore_index=True))

    A   B
0  A0  B0
1  A1  B1
    A   B
0  A2  B2
1  A3  B3
    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3

<h4>Adding MultiIndex Keys</h4>

In [19]:
# Use keys options to specify the label for the data sources.

# The result will be hierarchically indexed series containing the data:

print(x);print(y);print(pd.concat([x,y], keys=["x","y"]))

    A   B
0  A0  B0
1  A1  B1
    A   B
0  A2  B2
1  A3  B3
      A   B
x 0  A0  B0
  1  A1  B1
y 0  A2  B2
  1  A3  B3

<h3>Concatenation with Joins</h3>

In [20]:
# In practice, data from different sources might have different sets of column names and pd.concat offers several
# options in this case. 

df5 = make_df("ABC",[1,2])
df6 = make_df("BCD",[3,4])
print(df5);print(df6);print(pd.concat([df5,df6]))

    A   B   C
1  A1  B1  C1
2  A2  B2  C2
    B   C   D
3  B3  C3  D3
4  B4  C4  D4
     A   B   C    D
1   A1  B1  C1  NaN
2   A2  B2  C2  NaN
3  NaN  B3  C3   D3
4  NaN  B4  C4   D4

In [21]:
# By default the join is a union of input columns but can be changed to intersectio as well
print(df5);print(df6);
print(pd.concat([df5,df6],join="outer"))

    A   B   C
1  A1  B1  C1
2  A2  B2  C2
    B   C   D
3  B3  C3  D3
4  B4  C4  D4
     A   B   C    D
1   A1  B1  C1  NaN
2   A2  B2  C2  NaN
3  NaN  B3  C3   D3
4  NaN  B4  C4   D4

In [22]:
print(df5);print(df6);
print(pd.concat([df5,df6],join="inner"))

    A   B   C
1  A1  B1  C1
2  A2  B2  C2
    B   C   D
3  B3  C3  D3
4  B4  C4  D4
    B   C
1  B1  C1
2  B2  C2
3  B3  C3
4  B4  C4

In [24]:
# Another option is to directly specify the index in remaining columns using the join_axes argument, which takes 
# a list of index objects. 
print(df5);print(df6);
print(pd.concat([df5,df6], join_axes=[df5.columns]))
# This is deprecated

    A   B   C
1  A1  B1  C1
2  A2  B2  C2
    B   C   D
3  B3  C3  D3
4  B4  C4  D4

TypeError: concat() got an unexpected keyword argument 'join_axes'

<h4>The append() method</h4>

In [25]:
# Use of append method
print(df1);print(df2);
print(df1.append(df2))

    A   B
1  A1  B1
2  A2  B2
    A   B
3  A3  B3
4  A4  B4
    A   B
1  A1  B1
2  A2  B2
3  A3  B3
4  A4  B4

/var/folders/c8/z4lh2j2s5kq5jvv28mrv0rw40000gn/T/ipykernel_10107/2679285992.py:3: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  print(df1.append(df2))

<h3>Combining Data Sets : Merge and Join</h3>

<h4>Relational Algebra</h4>

In [26]:
# The behaviour implemented in pd.merge() is a subset of what is known as relational algebra.

# Relational Algebra is a formal set of rules for manipulating relational data and forms the conceptual 
# foundation of operations available in most databases.

<h4>Categories of Joins</h4>

In [27]:
# The pd.merge() implements various types of Joins:

# one-to-one
# many-to-one
# many-to-many

# All three types of joins are accessed via an identical call to pd.merge() interface; the type of join 
# performed depends on the form of input data.

<h5>One-to-One Joins</h5>

In [28]:
# The simplest form merge expression is one-to-one join which is similar to column wise concatenation

# Following two data sets containing information on various employees in a company:

df1 = pd.DataFrame({"employee":["Bob","Jake","Lisa","Sue"],
                     "group":["Accounting","Engineering","Engineering","HR"]})
df2 = pd.DataFrame({"employee":['Lisa', 'Bob', 'Jake', 'Sue'],
                     "hire_date":[2004, 2008, 2012, 2014]})
print(df1);print(df2);

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR
  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014

In [29]:
df3 = pd.merge(df1,df2)
df3

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

<h5>Many-to-One joins</h5>

In [30]:
# Many to one joins are joins in which one of the two key columns contains duplicate entries. 

# For the many to one case, the resulting dataFrame will preserve those duplicate entries as appropriate.

df4 = pd.DataFrame({"group": ["Accounting","Engineering", "HR"],
                    "supervisor":["Carly","Guido","Steve"]})
print(df3);print(df4);print(pd.merge(df3,df4))

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014
         group supervisor
0   Accounting      Carly
1  Engineering      Guido
2           HR      Steve
  employee        group  hire_date supervisor
0      Bob   Accounting       2008      Carly
1     Jake  Engineering       2012      Guido
2     Lisa  Engineering       2004      Guido
3      Sue           HR       2014      Steve

<h5>Many-to-Many joins</h5>

In [31]:
# If the key column in both the left and right array contains duplicates, then the result is a many-to-many
# merge. 

df5 = pd.DataFrame({"group":["Accounting", "Accounting", "Engineering", "Engineering", "HR","HR"],
                    "skills":["math","spreadsheets","coding","linux","spreadsheets","organization"]})
print(df1);print(df5);print(pd.merge(df1,df5))

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR
         group        skills
0   Accounting          math
1   Accounting  spreadsheets
2  Engineering        coding
3  Engineering         linux
4           HR  spreadsheets
5           HR  organization
  employee        group        skills
0      Bob   Accounting          math
1      Bob   Accounting  spreadsheets
2     Jake  Engineering        coding
3     Jake  Engineering         linux
4     Lisa  Engineering        coding
5     Lisa  Engineering         linux
6      Sue           HR  spreadsheets
7      Sue           HR  organization

<h3>Specification of the Merge Key</h3>

In [32]:
# pd.merge() : looks for one or more matching columns between the two inputs and uses this as key. 

# often the column names do not match, in those scenarios pd.merge provides variety of options.

<h4>The on keyword</h4>

In [34]:
# You can specify the name of the key column using the "on" keyword, which takes a column name or a list of
# column names:
print(df1);print(df2);print(pd.merge(df1,df2,on="employee"))

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR
  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014
  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

In [35]:
# The option of "on" keyword works only if both left and right DataFrames have the specified column name.

<h4>The left_on and right_on keyword</h4>

In [36]:
# To merge two datasets with two different column names, in which case left_on and right_on keywords can be used
# to specify two column names:

df3 = pd.DataFrame({"name":["Bob","Jake","Lisa","Sue"],
                    "salary":[70000,80000,120000,90000]})
print(df1);print(df3)
print(pd.merge(df1,df3, left_on="employee", right_on="name"))

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR
   name  salary
0   Bob   70000
1  Jake   80000
2  Lisa  120000
3   Sue   90000
  employee        group  name  salary
0      Bob   Accounting   Bob   70000
1     Jake  Engineering  Jake   80000
2     Lisa  Engineering  Lisa  120000
3      Sue           HR   Sue   90000

In [37]:
# We can drop redundant column

pd.merge(df1, df3, left_on="employee", right_on="name").drop("name",axis=1)

  employee        group  salary
0      Bob   Accounting   70000
1     Jake  Engineering   80000
2     Lisa  Engineering  120000
3      Sue           HR   90000

<h4>The left_index and right_index keywords</h4>

In [38]:
# These keywords help in merging on an index:
df1a = df1.set_index("employee")
df2a = df2.set_index("employee")
print(df1a);print(df2a)

                group
employee
Bob        Accounting
Jake      Engineering
Lisa      Engineering
Sue                HR
          hire_date
employee
Lisa           2004
Bob            2008
Jake           2012
Sue            2014

In [39]:
# The index can be used as the key for merging by specifying the left_index and/or right_index flags:
print(df1a);print(df2a);
print(pd.merge(df1a,df2a, left_index=True,right_index=True))

                group
employee
Bob        Accounting
Jake      Engineering
Lisa      Engineering
Sue                HR
          hire_date
employee
Lisa           2004
Bob            2008
Jake           2012
Sue            2014
                group  hire_date
employee
Bob        Accounting       2008
Jake      Engineering       2012
Lisa      Engineering       2004
Sue                HR       2014

In [40]:
# DataFrames implement the join() method which performs a merge that defaults to joining on indices:
print(df1a);print(df2a);
print(df1a.join(df2a))

                group
employee
Bob        Accounting
Jake      Engineering
Lisa      Engineering
Sue                HR
          hire_date
employee
Lisa           2004
Bob            2008
Jake           2012
Sue            2014
                group  hire_date
employee
Bob        Accounting       2008
Jake      Engineering       2012
Lisa      Engineering       2004
Sue                HR       2014

In [41]:
# Indexes and columns can be mixed together with all the four keywords as follows:

print(df1a);print(df3);
print(pd.merge(df1a,df3,left_index=True, right_on="name"))

                group
employee
Bob        Accounting
Jake      Engineering
Lisa      Engineering
Sue                HR
   name  salary
0   Bob   70000
1  Jake   80000
2  Lisa  120000
3   Sue   90000
         group  name  salary
0   Accounting   Bob   70000
1  Engineering  Jake   80000
2  Engineering  Lisa  120000
3           HR   Sue   90000

<h3>Specifying Set Arithmetic for Joins</h3>

In [42]:
# Scenario : We have glossed over one important consideration in performing a join: The type of set arithmetic
# used in the join. 

# This comes up when value appears in one key column but not the other.

In [46]:
# Example

df6 = pd.DataFrame({"name":["Peter","Paul","Mary"],
                    "food":["fish","beans","bread"]},columns=["name","food"])
df7 = pd.DataFrame({"name":["Mary","Joseph"],
                    "drink":["wine","beer"]},columns=["name","drink"])
print(df6);print(df7);print(pd.merge(df6,df7))

    name   food
0  Peter   fish
1   Paul  beans
2   Mary  bread
     name drink
0    Mary  wine
1  Joseph  beer
   name   food drink
0  Mary  bread  wine

In [47]:
# By default the result contains the intersection of the two sets of inputs, this is known as inner join. 

# we can specify this using the how keyword

pd.merge(df6,df7, how="inner")

   name   food drink
0  Mary  bread  wine

In [48]:
# The other values of the keyword can be "outer","left" and "right"

# An outer join returns a join over the union of input columns and fills the value with NANs where missing value 
# occurs.
pd.merge(df6,df7, how="outer")

     name   food drink
0   Peter   fish   NaN
1    Paul  beans   NaN
2    Mary  bread  wine
3  Joseph    NaN  beer

In [49]:
# The left join and right join over the left entries and right entries respectively.
print(df6);print(df7);print(pd.merge(df6,df7,how="left"))

    name   food
0  Peter   fish
1   Paul  beans
2   Mary  bread
     name drink
0    Mary  wine
1  Joseph  beer
    name   food drink
0  Peter   fish   NaN
1   Paul  beans   NaN
2   Mary  bread  wine

In [50]:
pd.merge(df6,df7,how="left")

    name   food drink
0  Peter   fish   NaN
1   Paul  beans   NaN
2   Mary  bread  wine

In [51]:
# using right
pd.merge(df6,df7,how="right")

     name   food drink
0    Mary  bread  wine
1  Joseph    NaN  beer

<h3>Overlapping Column Names</h3>

In [52]:
# Cases where your two input DataFrames hae conflicting columns. 

df8 = pd.DataFrame({"name":["Bob","Jake","Lisa","Sue"],
                    "rank":[1,2,3,4]})
df9 = pd.DataFrame({"name":["Bob","Jake","Lisa","Sue"],
                    "rank":[3,1,4,2]})
print(df8);print(df9);print(pd.merge(df8,df9,on="name"))

   name  rank
0   Bob     1
1  Jake     2
2  Lisa     3
3   Sue     4
   name  rank
0   Bob     3
1  Jake     1
2  Lisa     4
3   Sue     2
   name  rank_x  rank_y
0   Bob       1       3
1  Jake       2       1
2  Lisa       3       4
3   Sue       4       2

In [53]:
# It is possible to specify a custom suffix using the suffixes keyword:
print(df8);print(df9)
pd.merge(df8,df9,on="name",suffixes=["_L","_R"])

   name  rank
0   Bob     1
1  Jake     2
2  Lisa     3
3   Sue     4
   name  rank
0   Bob     3
1  Jake     1
2  Lisa     4
3   Sue     2

   name  rank_L  rank_R
0   Bob       1       3
1  Jake       2       1
2  Lisa       3       4
3   Sue       4       2

<h3>Example: US Data</h3>

In [55]:
pop = pd.read_csv("state-population.csv")
areas = pd.read_csv("state-areas.csv")
abbrevs = pd.read_csv("state-abbrevs.csv")

In [56]:
pop.head()

  state/region     ages  year  population
0           AL  under18  2012   1117489.0
1           AL    total  2012   4817528.0
2           AL  under18  2010   1130966.0
3           AL    total  2010   4785570.0
4           AL  under18  2011   1125763.0

In [57]:
areas.head()

        state  area (sq. mi)
0     Alabama          52423
1      Alaska         656425
2     Arizona         114006
3    Arkansas          53182
4  California         163707

In [58]:
abbrevs.head()

        state abbreviation
0     Alabama           AL
1      Alaska           AK
2     Arizona           AZ
3    Arkansas           AR
4  California           CA

In [60]:
merged = pd.merge(pop, abbrevs, how="outer",
                 left_on="state/region",right_on="abbreviation")
merged = merged.drop("abbreviation",1)
merged.head()

/var/folders/c8/z4lh2j2s5kq5jvv28mrv0rw40000gn/T/ipykernel_10107/1314909979.py:3: FutureWarning: In a future version of pandas all arguments of DataFrame.drop except for the argument 'labels' will be keyword-only.
  merged = merged.drop("abbreviation",1)

  state/region     ages  year  population    state
0           AL  under18  2012   1117489.0  Alabama
1           AL    total  2012   4817528.0  Alabama
2           AL  under18  2010   1130966.0  Alabama
3           AL    total  2010   4785570.0  Alabama
4           AL  under18  2011   1125763.0  Alabama

In [61]:
# Check rows which are having missing values
merged.isnull().any()

state/region    False
ages            False
year            False
population       True
state            True
dtype: bool

In [62]:
# Get the merged information which are null:
merged[merged["population"].isnull()].head()

     state/region     ages  year  population state
2448           PR  under18  1990         NaN   NaN
2449           PR    total  1990         NaN   NaN
2450           PR    total  1991         NaN   NaN
2451           PR  under18  1991         NaN   NaN
2452           PR    total  1993         NaN   NaN

In [63]:
# State entries not being marked and are null
merged.loc[merged["state"].isnull(),"state/region"].unique()

array(['PR', 'USA'], dtype=object)

In [64]:
merged.loc[merged["state/region"] == "PR","state"] = "Puerto Rico"
merged.loc[merged["state/region"] == "USA","state"] = "United States"

In [65]:
merged.isnull().any()

state/region    False
ages            False
year            False
population       True
state           False
dtype: bool

In [66]:
# Merging the result with the area data. 

final = pd.merge(merged, areas, on="state",how="left")
final.head()

  state/region     ages  year  population    state  area (sq. mi)
0           AL  under18  2012   1117489.0  Alabama        52423.0
1           AL    total  2012   4817528.0  Alabama        52423.0
2           AL  under18  2010   1130966.0  Alabama        52423.0
3           AL    total  2010   4785570.0  Alabama        52423.0
4           AL  under18  2011   1125763.0  Alabama        52423.0

In [67]:
# Check for nulls in area column
final.isnull().any()

state/region     False
ages             False
year             False
population        True
state            False
area (sq. mi)     True
dtype: bool

In [69]:
# Check which regions are ignored here
final["state"][final["area (sq. mi)"].isnull()].unique()

array(['United States'], dtype=object)

In [70]:
# Drop null values
final.dropna(inplace=True)
final.head()

  state/region     ages  year  population    state  area (sq. mi)
0           AL  under18  2012   1117489.0  Alabama        52423.0
1           AL    total  2012   4817528.0  Alabama        52423.0
2           AL  under18  2010   1130966.0  Alabama        52423.0
3           AL    total  2010   4785570.0  Alabama        52423.0
4           AL  under18  2011   1125763.0  Alabama        52423.0

In [71]:
# Use query method to fetch the data from final
data2010 = final.query("year == 2010 & ages == 'total'")
data2010.head()

    state/region   ages  year  population       state  area (sq. mi)
3             AL  total  2010   4785570.0     Alabama        52423.0
91            AK  total  2010    713868.0      Alaska       656425.0
101           AZ  total  2010   6408790.0     Arizona       114006.0
189           AR  total  2010   2922280.0    Arkansas        53182.0
197           CA  total  2010  37333601.0  California       163707.0

In [72]:
# Populate population density and display the same in order
data2010.set_index("state",inplace=True)
density = data2010["population"]/data2010["area (sq. mi)"]

In [73]:
# Population Density
density.sort_values(ascending=False,inplace=True)
density.head()

state
District of Columbia    8898.897059
Puerto Rico             1058.665149
New Jersey              1009.253268
Rhode Island             681.339159
Connecticut              645.600649
dtype: float64

In [75]:
# End of the data set 
density.tail()

state
South Dakota    10.583512
North Dakota     9.537565
Montana          6.736171
Wyoming          5.768079
Alaska           1.087509
dtype: float64